app/controllers/comics_controller.rb

SELECT "comics".* FROM "comics"
---
  def index
    @comics = Comic.all

INSERT INTO "comics" ("title", "desrciption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "as"], ["desrciption", "as"], ["user_id", "1"], ["created_at", "2015-11-20 07:37:12.332310"], ["updated_at", "2015-11-20 07:37:12.332310"]]
---
  def create
    @comic = current_user.comics.build(comic_params)

    # I'd remove this until you actually have a use for your app to be an API
    # I'd also suggest against using scaffold generator until you've built ~4
    # rails apps by hand
    respond_to do |format|
      if @comic.save

DELETE FROM "comics" WHERE "comics"."id" = $1  [["id", 1]]
---
  def destroy
    @comic.destroy

SELECT  "comics".* FROM "comics" WHERE "comics"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_comic
      @comic = Comic.find(params[:id])